package com.example.liargame.DEFINES

object DEFINES {

    var MAX_PLAYER_COUNT = 7
    var MIN_PLAYER_COUNT = 3
    var MAX_HINT_COUNT = 9
    var MIN_HINT_COUNT = 3

    var PLAYER_COUNT : Int = 3
    var GAME_MODE : Enum<GameModeEnum> = GameModeEnum.NORMAL
    var HINT_COUNT : Int = 9

    var SUBJECT : Enum<SubjectEnum> = SubjectEnum.OBJECT

    object WORD {

        var OBJECT_LIST : ArrayList<String> = arrayListOf(
            "장난감", "컴퓨터", "마우스", "지갑", "숟가락", "양말", "물통", "나무","세탁기","칼","가위","테이프","불펜","노트북","핸드폰","의자","컵","카메라","책","돈","커피머신","고무장갑","낚시대"
        )

        var FOOD_LIST : ArrayList<String> = arrayListOf(
            "김치찌개", "계란말이", "짜장면", "짬뽕", "치킨", "막국수", "제육볶음", "마카롱","샌드위치","피자","육회","초밥","우동","케밥","김밥","커리","스테이크","파스타","불고기","김치볶음밥","돈까스","순대국밥"
        )

        var JOB_LIST : ArrayList<String> = arrayListOf(
            "선생님", "의사", "변호사", "버스기사", "축구선수", "영화감독", "배우", "pd","유튜버","심판","교수","요리사","회사원","군인","프로듀서","프로그래머","수의사","소방관","경찰","기자","번역가","가이드","정치인"
        )

        var MOVIE_LIST : ArrayList<String> = arrayListOf(
            "아바타", "인셉션", "아이언맨", "어벤져스", "해리포터", "아저씨", "쿵푸팬더","완득이","트랜스포머","도둑들","광해,왕이 된 남자","7번방의 선물","설국열차","명량","겨울왕국","인터스텔라","베테랑","부산행","곡성","신과함께","범죄도시","보헤미안랩소디","극한직업","너의이름은"
        )

        var SINGER_LIST : ArrayList<String> = arrayListOf(
            "아이유", "소녀시대", "티아라", "원더걸스", "2NEL", "카라", "비스트", "리쌍", "시스타", "다비치", "허각", "싸이", "버스커버스커", "빅뱅", "리쌍", "에이핑크", "이승철", "박효신", "sanE(산이)", "걸스데이", "자이언티", "트와이스", "여자친구", "앰씨더맥스", "어반자카파", "지코", "볼빨간사춘기", "크러쉬", "에일리", "폴킴", "멜로망스", "로이킴", "마마무", "방탄소년단", "아이콘", "태연", "잔나비", "창모", "레드벨벳", "악동뮤지션","에스파", "이무진", "아이브", "르세라핌", "뉴진스" , "임영웅", "성시경","윤하","동방신기"
        )

        var ANIMAL_LIST : ArrayList<String> = arrayListOf(
            "강아지","고양이","호랑이","흰수염고래","앵무새", "곰", "원숭이", "고슴도치","판다","뱀","햄스터","말","거북","독수리","타조","참새","비둘기","고등어","갈치","새우","소","얼룩말","하마","코뿔소","코끼리","오징어","개미핥기","펭귄","기린","낙타","북극곰"
        )
    }
}